[
  {
    "id": 1,
    "groupName": "dev/null",
    "groupLogo": "prog",
    "date": "сегодня в 8:35",
    "textContent": "«Тинькофф» будет использовать ИИ для определения индивидуального кэшбэка. И для того, какой дошик сегодня вам стоит купить.\n\nСистема RECO, которая в течение двух лет обучалась на покупках клиентов жёлтого банка, будет исходя из ваших покупок и их частоты и размера решать, на какой ещё товар дать вам кэшбэк. Более того, она будет следить за вашим рационом и предлагать коррективы, если вы постоянно едите одно и то же.",
    "pictureName": "beer",
    "likesCount": 373,
    "commentsCount": 28,
    "sharesCount": 3,
    "viewings": "45K"
  },
  {
    "id": 2,
    "groupName": "dev/null",
    "groupLogo": "prog",
    "date": "вчера в 10:10",
    "textContent": "Девушка: *Злится, потому что я ее игнорирую*\nВорнинги компилятора:",
    "pictureName": "first_time",
    "likesCount": 1596,
    "commentsCount": 21,
    "sharesCount": 24,
    "viewings": "60K"
  },
  {
    "id": 3,
    "groupName": "Тинькофф Образование",
    "groupLogo": "prog",
    "date": "54 минуты назад",
    "textContent": "Продолжаем вступительные лекции по олимпиадной математике ⭐\n\nПятое занятие для ребят 5—7 классов будет завтра, 1 октября с 17:00 до 18:00. Мы снова встретимся с Михаилом Григорьевым, на этот раз он расскажет о принципе крайнего. Встречаемся, как обычно, в Zoom, номер конференции: 993 0417 8776.\n\nВ этот же день, только с 19:00 до 20:00, Александр Матушкин проведет лекцию для школьников 8—11 классов, тема — «Потоки в транспортных сетях». Номер конференции в Zoom: 942 8904 0814.\n\nЗаписи лекции, конспекты и тематические листы с задачами опубликуем после занятий.",
    "pictureName": "big_pict",
    "likesCount": 4,
    "commentsCount": 1,
    "sharesCount": 1,
    "viewings": "774"
  },
  {
    "id": 4,
    "groupName": "Типичная Казань | Главное сообщество Казани",
    "groupLogo": "prog",
    "date": "сегодня в 12:09",
    "textContent": "С сегодняшнего дня в Казани начнутся массовые рейды в общественном транспорте - будут проверять наличие масок у пассажиров. Тех, кто не соблюдает требование будут высаживать из автобусов, трамваев, троллейбусов и метро. Также на предмет ношения масок проверят объекты торговли.",
    "pictureName": "long_pict",
    "likesCount": 30,
    "commentsCount": 2,
    "sharesCount": 1,
    "viewings": "1.8K"
  },
  {
    "id": 5,
    "groupName": "OnlyText",
    "groupLogo": "prog",
    "date": "вчера в 11:40",
    "textContent": "Путeшecтвиe вo врeмeни нe нaрушит принцип причиннocти.\nOдин из глaвных пaрaдoкcoв, кoтoрый cтaвит пoд coмнeниe вoзмoжнocть путeшecтвиe вo врeмeни — принцип причиннocти: нaпримeр, вы зaхoтитe пeрeмecтитьcя вo врeмeни и прeдoтврaтить зaрaжeниe нулeвoгo пaциeнтa COVID-19. Тoгдa пaндeмии нe вoзникнeт и у вac в будущeм нe будeт мoтивaции измeнить прoшлoe.\n\nOднaкo cтудeнт Квинcлeндcкoгo унивeрcитeтa вмecтe co cвoим нaучным рукoвoдитeлeм нaшeл cпocoб мaтeмaтичecки oпиcaть путeшecтвиe вo врeмeни тaк, чтoбы при этoм нe вoзникaлo врeмeнных пaрaдoкcoв и выпoлнялcя принцип caмocoглacoвaннocти Нoвикoвa.\n\nCoглacнo нoвым иccлeдoвaниям, при тaкoм путeшecтвии вo врeмeни вы нe мoжeтe cдeлaть ничeгo, чтo мoглo бы вызвaть пaрaдoкc. Coбытия прocтo будут пoдcтрaивaтьcя тaк, чтoбы быть лoгичecки coглacoвaнными c тeм, чтo прoизoйдeт в будущeм. Нaпримeр, ecли вы прeдoтврaтитe зaрaжeниe нулeвoгo пaциeнтa COVID-19, тo мoжeтe caми cтaть нулeвым пaциeнтoм и пaндeмия вce рaвнo нaчнeтcя.\n\nПo cлoвaм учeных, oни oткрыли нecкoлькo нoвых мaтeмaтичecких прoцeccoв, кoтoрыe пoкaзaли, чтo кaк бы вы ни cтaрaлиcь coздaть пaрaдoкc, coбытия вceгдa будут приcпocaбливaтьcя caми, чтoбы избeжaть нaрушeния принципa причиннocти.",
    "pictureName": "",
    "likesCount": 0,
    "commentsCount": 0,
    "sharesCount": 0,
    "viewings": ""
  },
  {
    "id": 6,
    "groupName": "OnlyPicture",
    "groupLogo": "prog",
    "date": "только что",
    "textContent": "",
    "pictureName": "long_pict",
    "likesCount": 0,
    "commentsCount": 0,
    "sharesCount": 0,
    "viewings": ""
  }
]